0x900C5649/nrf52_boards/source/connectivity/hid.c
#include "hid.h"
#include "util.h"
#include "hal.h"

/*  LOG INIT  */
#define NRF_LOG_MODULE_NAME hid

#include "nrf_log.h"

NRF_LOG_MODULE_REGISTER();
/*            */


#if MODULE_ENABLED(APP_HID)

// static declaration

/**
 * @brief Initialize USB HID interface.
 *
 * @return Standard error code.
 */
static uint32_t hid_if_init(void);


/**
 * @brief Send CTAP HID Data.
 *
 *
 * @param[in] cid       HID Channel identifier.
 * @param[in] cmd       Frame command.
 * @param[in] p_data    Frame Data packet.
 * @param[in] size      Data length
 *
 * @return Standard error code.
 */
static uint8_t hid_if_send(uint32_t cid, uint8_t cmd,
                        uint8_t * p_data, size_t size);


/**
 * @brief Receive CTAP HID Data.
 *
 *
 * @param[out] p_cid       HID Channel identifier.
 * @param[out] p_cmd       Frame command.
 * @param[out] p_data      Frame Data packet.
 * @param[out] p_size      Data length
 * @param[in]  timeout     message timeout in ms
 *
 * @return Standard error code.
 */
static uint8_t hid_if_recv(uint32_t * p_cid, uint8_t * p_cmd,
                    uint8_t * p_data, size_t * p_size,
                    uint32_t timeout);

/**
 * @brief CTAP HID interface process.
 *
 *
 */
static void hid_if_process(void);

/**
 * @brief USBD library specific event handler.
 *
 * @param event     USBD library event.
 * */
static void usbd_user_ev_handler(app_usbd_event_type_t event);

/**
 * @brief User event handler.
 * */
static void hid_user_ev_handler(app_usbd_class_inst_t const * p_inst,
                                app_usbd_hid_user_event_t event);


/**
 * @brief handler for idle reports.
 *
 * @param p_inst      Class instance.
 * @param report_id   Number of report ID that needs idle transfer.
 * */
static ret_code_t idle_handle(app_usbd_class_inst_t const * p_inst,
                              uint8_t report_id);

/**
 * \brief send one HID frame.
 */
static uint8_t hid_if_frame_send(U2FHID_FRAME * p_frame);

/**
 * @brief U2FHID process function, which should be executed when data is ready.
 *
 */
static void internal_hid_process(void); //TODO

/**
 * @brief Function for initializing the U2F HID.
 *
 * @return Error status.
 *
 */
static ret_code_t internal_hid_init(void); //TODO

/**@brief Process U2FHID command of every ready channel.
 * 
 */
static void channel_process(void);

/**@brief Process U2FHID command
 *
 * @param[in]  p_ch  Pointer to U2F Channel.
 * 
 */
static void channel_cmd_process(hid_channel_t * p_ch);


/**@brief Handle a U2FHID LOCK response
 *
 * @param[in]  p_ch  Pointer to U2F Channel.
 * 
 */
static void hid_lock_response(hid_channel_t *p_ch);

/**@brief Handle a U2FHID SYNC response
 *
 * @param[in]  p_ch  Pointer to U2F Channel.
 * 
 */
static void hid_sync_response(hid_channel_t *p_ch);

/**@brief Handle a U2FHID PING response
 *
 * @param[in]  p_ch  Pointer to U2F Channel.
 * 
 */
static void hid_ping_response(hid_channel_t *p_ch);

/**@brief Handle a U2FHID MESSAGE response
 *
 * @param[in]  p_ch  Pointer to U2F Channel.
 * 
 */
static void hid_msg_response(hid_channel_t * p_ch);

/**@brief Send a U2F HID status code only
 *
 * @param[in]  p_ch    Pointer to U2F Channel.
 * @param[in]  status  U2F HID status code.
 *
 */
static void hid_status_response(hid_channel_t * p_ch, uint16_t status);


/**@brief Handle a U2FHID WINK response
 *
 * @param[in]  p_ch  Pointer to U2F Channel.
 * 
 */
static void hid_wink_response(hid_channel_t *p_ch);

/**@brief Handle a U2FHID INIT response
 *
 * @param[in]  p_ch  Pointer to U2F Channel.
 * 
 */
static void hid_init_response(hid_channel_t *p_ch);

/**@brief Handle a CTAPHID CBOR response
 *
 * @param[in]  p_ch  Pointer to Channel.
 * 
 */
static void hid_cbor_response(hid_channel_t *p_ch);

/**@brief Send a U2FHID_ERROR response
 *
 * @param[in]  cid   Channel identifier.
 * @param[in]  code  Error code.
 * 
 */
static void hid_error_response(uint32_t cid, uint8_t error);

/**@brief Generate new U2F Channel identifier.
 *
 *
 * @retval     New Channel identifier.
 */
static uint32_t generate_new_cid(void);

/**@brief Find the U2F Channel by cid.
 *
 * @param[in]  cid  Channel identifier.
 *
 * @retval     Valid U2F Channel if the procedure was successful, else, NULL.
 */
static hid_channel_t * channel_find(uint32_t cid);

/**@brief Uninitialize U2F Channel.
 *
 * @param[in]  p_ch  Pointer to U2F Channel.
 *
 */
static void channel_deinit(hid_channel_t * p_ch);

/**@brief Initialize U2F Channel.
 *
 * @param[in]  p_ch  Pointer to U2F Channel.
 * @param[in]  cid   Channel identifier.
 *
 */
static void channel_init(hid_channel_t * p_ch, uint32_t cid);

/**@brief Resets Channel. Keeps cid;
 *
 * @param[in]  p_ch  Pointer to Channel.
 *
 */
static void channel_reset(hid_channel_t * p_ch, uint32_t cid);

/**@brief U2F Channel allocation function.
 *
 *
 * @retval    Valid memory location if the procedure was successful, else, NULL.
 */
static hid_channel_t * channel_alloc(void);



extern bool is_user_button_pressed(void);


/**
 * @brief Reuse HID mouse report descriptor for HID generic class
 */
APP_USBD_HID_GENERIC_SUBCLASS_REPORT_DESC(ctap_hid_desc,
                                          APP_USBD_U2F_HID_REPORT_DSC);

static const app_usbd_hid_subclass_desc_t * reports[] = {&ctap_hid_desc};

/*lint -save -e26 -e64 -e123 -e505 -e651*/

/**
 * @brief Global HID generic instance
 */
APP_USBD_HID_GENERIC_GLOBAL_DEF(m_app_ctap_hid,
                                FIDO_HID_INTERFACE,
                                hid_user_ev_handler,
                                ENDPOINT_LIST(),
                                reports,
                                REPORT_IN_QUEUE_SIZE,
                                REPORT_OUT_MAXSIZE,
                                REPORT_FEATURE_MAXSIZE,
                                APP_USBD_HID_SUBCLASS_NONE,
                                APP_USBD_HID_PROTO_GENERIC);

/*lint -restore*/


/**
 * @brief Mark the ongoing transmission
 *
 * Marks that the report buffer is busy and cannot be used until
 * transmission finishes or invalidates (by USB reset or suspend event).
 */
static bool m_report_pending = false;


/**
 * @brief Mark a report received.
 *
 */
static bool m_report_received = false;



retvalue hid_init(void)
{
    NRF_LOG_INFO("init hid");

    NRF_LOG_INFO("init hid done");
}

retvalue hid_process(void)
{

