0x900C5649/nrf52_boards/source/connectivity/hid.c
}



static void usbd_user_ev_handler(app_usbd_event_type_t event)
{
    switch (event)
    {
        case APP_USBD_EVT_DRV_SOF:
            break;
        case APP_USBD_EVT_DRV_RESET:
            m_report_pending = false;
            break;
        case APP_USBD_EVT_DRV_SUSPEND:
            m_report_pending = false;
            // Allow the library to put the peripheral into sleep mode
            app_usbd_suspend_req();
            bsp_board_leds_off();
            break;
        case APP_USBD_EVT_DRV_RESUME:
            m_report_pending = false;
            bsp_board_led_on(LED_U2F_WINK);
            break;
        case APP_USBD_EVT_STARTED:
            m_report_pending = false;
            bsp_board_led_on(LED_U2F_WINK);
            break;
        case APP_USBD_EVT_STOPPED:
            app_usbd_disable();
            bsp_board_leds_off();
            break;
        case APP_USBD_EVT_POWER_DETECTED:
            NRF_LOG_INFO("USB power detected");
            if (!nrf_drv_usbd_is_enabled())
            {
                app_usbd_enable();
            }
            break;
        case APP_USBD_EVT_POWER_REMOVED:
            NRF_LOG_INFO("USB power removed");
            app_usbd_stop();
            break;
        case APP_USBD_EVT_POWER_READY:
            NRF_LOG_INFO("USB ready");
            app_usbd_start();
            break;
        default:
            break;
    }
}

/**
 * \brief send one HID frame.
 */
static uint8_t hid_if_frame_send(U2FHID_FRAME * p_frame)
{
    ret_code_t ret;

    while(m_report_pending){
        while (app_usbd_event_queue_process())
        {
            /* Nothing to do */
        }
    }

    ret = app_usbd_hid_generic_in_report_set(
        &m_app_ctap_hid,
        (uint8_t *)p_frame,
        HID_RPT_SIZE);

    if(ret == NRF_SUCCESS)
    {
        m_report_pending = true;
        return ERR_NONE;
    }

    return ERR_OTHER;
}


static uint8_t hid_if_send(uint32_t cid, uint8_t cmd, uint8_t *p_data, size_t size)
{
    U2FHID_FRAME frame;
    int ret;
    size_t frameLen;
    uint8_t seq = 0;

    frame.cid = cid;
    frame.init.cmd = TYPE_INIT | cmd;
    frame.init.bcnth = (size >> 8) & 0xFF;
    frame.init.bcntl = (size & 0xFF);

    frameLen = MIN(size, sizeof(frame.init.data));
    memset(frame.init.data, 0, sizeof(frame.init.data));
    memcpy(frame.init.data, p_data, frameLen);

    do
    {
        ret = hid_if_frame_send(&frame);
        if(ret != ERR_NONE) return ret;

        size -= frameLen;
        p_data += frameLen;

        frame.cont.seq = seq++;
        frameLen = MIN(size, sizeof(frame.cont.data));
        memset(frame.cont.data, 0, sizeof(frame.cont.data));
        memcpy(frame.cont.data, p_data, frameLen);
    } while(size);

    return ERR_NONE;
}



static uint8_t hid_if_recv(uint32_t * p_cid, uint8_t * p_cmd,
                    uint8_t * p_data, size_t * p_size,
                    uint32_t timeout)
{
    uint8_t * p_recv_buf;
    size_t recv_size, totalLen, frameLen;
    U2FHID_FRAME * p_frame;
    uint8_t seq = 0;

    Timer timer;
    countdown_ms(&timer, timeout);

    if(!m_report_received) return ERR_OTHER+1;
    m_report_received = false;

    p_recv_buf = (uint8_t *)app_usbd_hid_generic_out_report_get(&m_app_ctap_hid,
                                                                &recv_size);

    if(recv_size != sizeof(U2FHID_FRAME)) return ERR_OTHER;

    p_frame = (U2FHID_FRAME *)p_recv_buf;

    if(FRAME_TYPE(*p_frame) != TYPE_INIT) return ERR_INVALID_CMD;

    *p_cid = p_frame->cid;
    *p_cmd = p_frame->init.cmd;

    totalLen = MSG_LEN(*p_frame);
    frameLen = MIN(sizeof(p_frame->init.data), totalLen);

    *p_size = totalLen;

    memcpy(p_data, p_frame->init.data, frameLen);
    totalLen -= frameLen;
    p_data += frameLen;

    while(totalLen)
    {
        while(!m_report_received)
        {
            while (app_usbd_event_queue_process())
            {
                /* Nothing to do */
            }
            if(has_timer_expired(&timer)) return ERR_MSG_TIMEOUT;
        }
        m_report_received = false;

        p_recv_buf = (uint8_t *)app_usbd_hid_generic_out_report_get(
                                                                &m_app_ctap_hid,
                                                                &recv_size);

        if(recv_size != sizeof(U2FHID_FRAME)) continue;

        p_frame = (U2FHID_FRAME *)p_recv_buf;

        if(p_frame->cid != *p_cid) continue;
        if(FRAME_TYPE(*p_frame) != TYPE_CONT) return ERR_INVALID_SEQ;
        if(FRAME_SEQ(*p_frame) != seq++) return ERR_INVALID_SEQ;

        frameLen = MIN(sizeof(p_frame->cont.data), totalLen);

        memcpy(p_data, p_frame->cont.data, frameLen);
        totalLen -= frameLen;
        p_data += frameLen;
    }

    return ERR_NONE;
}


/**
 * @brief Class specific event handler.
 *
 * @param p_inst    Class instance.
 * @param event     Class specific event.
 * */
static void hid_user_ev_handler(app_usbd_class_inst_t const * p_inst,
                                app_usbd_hid_user_event_t event)
{

    switch (event)
    {
        case APP_USBD_HID_USER_EVT_OUT_REPORT_READY:
        {
            m_report_received = true;
            break;
        }
        case APP_USBD_HID_USER_EVT_IN_REPORT_DONE:
        {
            m_report_pending = false;
            break;
        }
        case APP_USBD_HID_USER_EVT_SET_BOOT_PROTO:
        {
            UNUSED_RETURN_VALUE(hid_generic_clear_buffer(p_inst));
            NRF_LOG_INFO("SET_BOOT_PROTO");
            break;
        }
        case APP_USBD_HID_USER_EVT_SET_REPORT_PROTO:
        {
            UNUSED_RETURN_VALUE(hid_generic_clear_buffer(p_inst));
            NRF_LOG_INFO("SET_REPORT_PROTO");
            break;
        }
        default:
            break;
    }
}


/**
 * @brief handler for idle reports.
 *
 * @param p_inst      Class instance.
 * @param report_id   Number of report ID that needs idle transfer.
 * */
static ret_code_t idle_handle(app_usbd_class_inst_t const * p_inst,
                              uint8_t report_id)
{
    switch (report_id)
    {
        case 0:
        {
            uint8_t report[] = {0xBE, 0xEF};
            return app_usbd_hid_generic_idle_report_set(
              &m_app_ctap_hid,
              report,
              sizeof(report));
        }
        default:
            return NRF_ERROR_NOT_SUPPORTED;
    }
}


static uint32_t hid_if_init(void)
{
	ret_code_t ret;

	static const app_usbd_config_t usbd_config = {
	    .ev_state_proc = usbd_user_ev_handler
	};

