0x900C5649/nrf52_boards/source/connectivity/hid.c
	ret = app_usbd_init(&usbd_config);
    APP_ERROR_CHECK(ret);

    app_usbd_class_inst_t const * class_inst;
    class_inst = app_usbd_hid_generic_class_inst_get(&m_app_ctap_hid);

    ret = hid_generic_idle_handler_set(class_inst, idle_handle);
    APP_ERROR_CHECK(ret);

    ret = app_usbd_class_append(class_inst);
    APP_ERROR_CHECK(ret);

    if (USBD_POWER_DETECTION)
    {
        ret = app_usbd_power_events_enable();
        APP_ERROR_CHECK(ret);
    }
    else
    {
        NRF_LOG_INFO("No USB power detection enabled\r\nStarting USB now");

        app_usbd_enable();
        app_usbd_start();
    }

    return ret;
}

static void hid_if_process(void)
{
    while (app_usbd_event_queue_process())
    {
        /* Nothing to do */
    }
}



/**
 * @brief List of channels.
 *
 */
channel_list_t m_ctap_ch_list = {NULL, NULL};


/**
 * @brief The count of channel used.
 *
 */
static uint8_t m_channel_used_cnt = 0;


/**@brief U2F Channel allocation function.
 *
 *
 * @retval    Valid memory location if the procedure was successful, else, NULL.
 */
static hid_channel_t * channel_alloc(void)
{
    hid_channel_t * p_ch;
    size_t size = sizeof(hid_channel_t);

    if(m_channel_used_cnt > MAX_HID_CHANNELS)
    {
        NRF_LOG_WARNING("MAX_HID_CHANNELS.");
        return NULL;
    }

    p_ch = nrf_malloc(size);
    if(p_ch == NULL)
    {
        NRF_LOG_ERROR("nrf_malloc: Invalid memory location!");
    }
    else
    {
        m_channel_used_cnt++;       
    }

    return p_ch;
}


/**@brief Initialize U2F Channel.
 *
 * @param[in]  p_ch  Pointer to U2F Channel.
 * @param[in]  cid   Channel identifier.
 *
 */
static void channel_init(hid_channel_t * p_ch, uint32_t cid)
{
    size_t size = sizeof(hid_channel_t);

    memset(p_ch, 0, size);

    p_ch->cid = cid;
    p_ch->state = CID_STATE_IDLE;
    p_ch->pPrev = NULL;
    p_ch->pNext = NULL;

    if(m_catp_ch_list.pFirst == NULL)
    {
        m_ctap_ch_list.pFirst = m_ctap_ch_list.pLast = p_ch;
    }
    else
    {
        p_ch->pPrev = m_ctap_ch_list.pLast;
        m_ctap_ch_list.pLast->pNext = p_ch;
        m_ctap_ch_list.pLast = p_ch;
    }
}


/**@brief Resets Channel. Keeps cid;
 *
 * @param[in]  p_ch  Pointer to Channel.
 *
 */
static void channel_reset(hid_channel_t * p_ch)
{
    p_ch->state = CID_STATE_IDLE;
}


/**@brief Uninitialize U2F Channel.
 *
 * @param[in]  p_ch  Pointer to U2F Channel.
 *
 */
static void channel_deinit(hid_channel_t * p_ch)
{
    if(p_ch->pPrev == NULL && p_ch->pNext == NULL)  //only one item in the list
    {
        m_ctap_ch_list.pFirst = m_ctap_ch_list.pLast = NULL;
    }
    else if(p_ch->pPrev == NULL)  // the first item
    {
        m_ctap_ch_list.pFirst = p_ch->pNext;
        p_ch->pNext->pPrev = NULL;
    }
    else if(p_ch->pNext == NULL) // the last item
    {
        m_ctap_ch_list.pLast = p_ch->pPrev;
        p_ch->pPrev->pNext = NULL;
    }
    else
    {
        p_ch->pPrev->pNext = p_ch->pNext;
        p_ch->pNext->pPrev = p_ch->pPrev;
    }
    nrf_free(p_ch);
    m_channel_used_cnt--;
}


/**@brief Find the U2F Channel by cid.
 *
 * @param[in]  cid  Channel identifier.
 *
 * @retval     Valid U2F Channel if the procedure was successful, else, NULL.
 */
static hid_channel_t * channel_find(uint32_t cid)
{
    
    hid_channel_t *p_ch;

    for(p_ch = m_ctap_ch_list.pFirst; p_ch != NULL; p_ch = p_ch->pNext)
    {
        if(p_ch->cid == cid)
        {
            return p_ch;
        }
    }

    return NULL;
}


/**@brief Generate new U2F Channel identifier.
 *
 *
 * @retval     New Channel identifier.
 */
static uint32_t generate_new_cid(void)
{
    static uint32_t cid = 0;
    do
    {
        cid++;
    }while(cid == 0 || cid == CID_BROADCAST);
    return cid;
}


/**@brief Send a HID_ERROR response
 *
 * @param[in]  cid   Channel identifier.
 * @param[in]  code  Error code.
 * 
 */
static void hid_error_response(uint32_t cid, uint8_t error)
{
    hid_if_send(cid, HID_ERROR, &error, 1);
}


/**@brief Handle a HID INIT response
 *
 * @param[in]  p_ch  Pointer to U2F Channel.
 * 
 */
static void hid_init_response(hid_channel_t *p_ch)
{
    HID_INIT_RESP *p_resp_init = (HID_INIT_RESP *) p_ch->resp;
    channel_t *p_new_ch;

    //if send on broadcast -> create new channel
    if (p_ch->cid == CID_BROADCAST) {

        //allocate mem for new channel
        p_new_ch = channel_alloc();
        if (p_new_ch == NULL) {
             hid_error_response(p_ch->cid, ERR_CHANNEL_BUSY);
             return;
        }
    
        //get new cid and init channel data
        channel_init(p_new_ch, generate_new_cid());
    }
    //else reset existing channel
    {
        channel_reset(p_ch);
        p_new_ch = p_ch;
    }
        
        //copy init nonce
        memcpy(p_resp_init->nonce, p_ch_req, INIT_NONCE_SIZE);

        p_resp_init->cid = p_new_ch->cid;                    // Channel identifier 
        p_resp_init->versionInterface = HID_IF_VERSION;   // Interface version
        p_resp_init->versionMajor = HID_FW_VERSION_MAJOR; // Major version number
        p_resp_init->versionMinor = HID_FW_VERSION_MINOR; // Minor version number
        p_resp_init->versionBuild = HID_FW_VERSION_BUILD; // Build version number
        p_resp_init->capFlags =   CAPABILITY_WINK
                                | CAPABILITY_CBOR
                                | CAPABILITY_NMSG; // Capabilities flags
        
        //clear user button state
        UNUSED_RETURN_VALUE(is_user_button_pressed());
        
        //send response
        hid_if_send(p_ch->cid, p_ch->cmd, (uint8_t *)p_resp_init, sizeof(HID_INIT_RESP) );
}


/**@brief Handle a U2FHID WINK response
 *
 * @param[in]  p_ch  Pointer to U2F Channel.
 * 
 */
static void hid_wink_response(hid_channel_t *p_ch)
{
    //board specific action (see hal.h/hal.c)
    board_wink();
    hid_if_send(p_ch->cid, p_ch->cmd, NULL, 0);
}


/**@brief Send a HID status code only
 *
 * @param[in]  p_ch    Pointer to U2F Channel.
 * @param[in]  status  HID status code.
 *
 */
static void hid_status_response(hid_channel_t * p_ch, uint8_t status)
{
    //send status code (in FIDO2 only single byte)
    hid_if_send(p_ch->cid, p_ch->cmd, status, 1);
}


/**@brief Handle a CTAPHID CBOR response
 *
 * @param[in]  p_ch  Pointer to Channel.
 * 
 */
static void hid_cbor_response(hid_channel_t *p_ch)
{
    CTAP_RESPONSE resp;
    uint8_t status;
    status = ctap_request(p_ch->req, bcnt, &resp);

    //set response status code
    memcpy(p_ch->resp, status, 1);
    
    //copy over response
    memcpy(p_ch->resp+1, resp.data, MIN(resp.length, CTAP_RESPONSE_BUFFER_SIZE));

    hid_if_send(p_ch->cid, p_ch->cmd, p_ch->resp, resp.length + 1);
}


/**@brief Handle a U2FHID MESSAGE response UNIMPLEMETED AND UNSUPPORTED
 *
 * @param[in]  p_ch  Pointer to U2F Channel.
 * 
 */
static void hid_msg_response(hid_channel_t * p_ch)
{
    // by flag indicated to not be implemented -> invalid CMD
    hid_status_response(p_ch, ERR_INVALID_CMD);
}

/**@brief Handle a U2FHID PING response
 *
 * @param[in]  p_ch  Pointer to U2F Channel.
 * 
 */
static void hid_ping_response(hid_channel_t *p_ch)
{
    //PONG (echo)
    hid_if_send(p_ch->cid, p_ch->cmd, p_ch->req, p_ch->bcnt);
}


/**@brief Handle a U2FHID SYNC response
 *
 * @param[in]  p_ch  Pointer to U2F Channel.
 * 
 */
static void hid_sync_response(hid_channel_t *p_ch)
{
    return;
}


/**@brief Handle a HID LOCK response
 *
 * @param[in]  p_ch  Pointer to U2F Channel.
 * 
 */
static void hid_lock_response(hid_channel_t *p_ch)
{
    //unimplemented
    hid_status_respondse(p_ch, ERR_INVALID_CMD);
}


/**@brief Process U2FHID command
 *
 * @param[in]  p_ch  Pointer to U2F Channel.
 * 
 */
static void channel_cmd_process(hid_channel_t * p_ch)
{

    countdown_ms(&p_ch->timer, U2FHID_TRANS_TIMEOUT);

    if(p_ch->state != CID_STATE_READY) return;

    switch(p_ch->cmd)
    {
        case HID_PING:
            NRF_LOG_INFO("HID_PING.");
            hid_ping_response(p_ch);
            break;

        case HID_MSG:
            NRF_LOG_INFO("HID_MSG.");
            hid_msg_response(p_ch);
            break;

        case HID_LOCK:
            NRF_LOG_INFO("HID_LOCK.");
            hid_lock_response(p_ch);
            break;

        case HID_INIT:
            NRF_LOG_INFO("HID_INIT.");
            hid_init_response(p_ch);
            break;
       
        case HID_CBOR:
            NRF_LOG_INFO("HID_CBOR.");
            hid_CBOR_response(p_ch);
            break;

        case HID_WINK:
            NRF_LOG_INFO("HID_WINK.");
            hid_wink_response(p_ch);
            break;

