0x900C5649/nrf52_boards/source/connectivity/hid.c
        case HID_SYNC:
            NRF_LOG_INFO("HID_SYNC.");
            hid_sync_response(p_ch);
            break;

        case HID_VENDOR_FIRST:
            NRF_LOG_INFO("HID_VENDOR_FIRST.");
            break;

        case HID_VENDOR_LAST:
            NRF_LOG_INFO("HID_VENDOR_LAST.");
            break;

        default:
            NRF_LOG_WARNING("Unknown Command: %d", p_ch->cmd);
            break;
    }

    p_ch->state = CID_STATE_IDLE;
}

/**@brief Process U2FHID command of every ready channel.
 * 
 */
static void channel_process(void)
{
    hid_channel_t *p_ch;

    for(p_ch = m_ctap_ch_list.pFirst; p_ch != NULL;)
    {
        
        // Transaction timeout, free the channel
        if(has_timer_expired(&p_ch->timer) && p_ch->state == CID_STATE_IDLE)
        {
            if(p_ch->cid != CID_BROADCAST)
            {
                hid_channel_t * p_free_ch = p_ch;
                p_ch = p_ch->pNext;
                channel_deinit(p_free_ch);
                continue;
            }
        }
        p_ch = p_ch->pNext;
    }
}


/**
 * @brief Function for initializing the U2F HID.
 *
 * @return Error status.
 *
 */
static ret_code_t internal_hid_init(void)
{
    ret_code_t ret;
    hid_channel_t *p_ch;

    ret = nrf_mem_init();
    if(ret != NRF_SUCCESS)
    {
        return ret;
    }

    ret = hid_if_init();
    if(ret != NRF_SUCCESS)
    {
    	return ret;
    }

    ret = u2f_impl_init(); //TODO
    if(ret != NRF_SUCCESS)
    {
    	return ret;
    }

    p_ch = channel_alloc();
    if(p_ch == NULL)
    {
        NRF_LOG_ERROR("NRF_ERROR_NULL!");
        return NRF_ERROR_NULL;
    }

    channel_init(p_ch, CID_BROADCAST);

    return NRF_SUCCESS;
}


/**
 * @brief U2FHID process function, which should be executed when data is ready.
 *
 */
static void internal_hid_process(void)
{
    uint8_t ret;
    uint32_t cid;
    uint8_t cmd;
    size_t size;
    uint8_t buf[U2F_MAX_REQ_SIZE];

    hid_if_process();

    ret = hid_if_recv(&cid, &cmd, buf, &size, 1000);

    if(ret == ERR_NONE)
    {
        hid_channel_t * p_ch;

        p_ch = channel_find(cid);

        if(p_ch == NULL)
        {
            NRF_LOG_ERROR("No valid channel found!");
            hid_error_response(cid, ERR_CHANNEL_BUSY);
        }
        else
        {
            p_ch->cmd = cmd;
            p_ch->bcnt = size;
            p_ch->state = CID_STATE_READY;
            memcpy(p_ch->req, buf, size);
            channel_cmd_process(p_ch);
        }
    }

    channel_process();
}


#endif //MODULE_ENABLED(APP_HID)

